# Terraform - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging/runs/run-iehSZtusfaisZ7Cx

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.common.module.shared.tfe_variable.shared_cockroach_api_key: Refreshing state... [id=var-xCXNYxxWHz4Z7y9j]
module.common.module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-foBp9KWzdPo36bbk]
module.common.module.organization.tfe_variable.organization_api_upstash_api_key: Refreshing state... [id=var-ztvCC6442ZTsRg2d]
module.common.module.identity.tfe_workspace.identity: Refreshing state... [id=ws-jvmAACcB8pH3R5fM]
module.common.module.shared.tfe_variable.shared_aws_access_key_id: Refreshing state... [id=var-uidVxrTST6gRrmGr]
module.common.module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-zu8QqzxM2YPdj21P]
module.common.module.customer.tfe_workspace.customer: Refreshing state... [id=ws-CsUvPJtdKfkw6Tha]
module.common.module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-4CvzemYdaoQcYHWq]
module.common.module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-6jY14zttatVdUKAx]
module.common.module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-viKCC52QLr1y5GBm]
module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-iDS7ceSq5YM9UUQ2]
module.common.module.shared.tfe_variable.shared_aws_secret_access_key: Refreshing state... [id=var-6w8raUq9aV6duruf]
module.common.module.identity.tfe_variable.identity_upstash_api_key: Refreshing state... [id=var-5jsE9vWjpx2C5WQS]
module.common.module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-an6RcRzg5PUWp1EV]
module.common.module.organization.tfe_variable.organization_upstash_api_key: Refreshing state... [id=var-9XugusGmh1ufCgKb]
module.common.module.shared.tfe_workspace.shared: Refreshing state... [id=ws-qpd548bdizLT6Brv]
module.common.tfe_project.default: Refreshing state... [id=prj-5ptbkLDzF4VHVqKE]
module.common.module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-TmYvRzLeD81uPDV9]
module.common.module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-9osT2C8rupAZuqaU]
module.common.module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-djuphP2cNVB7ZjBB]
module.common.module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-CF14Qcd5FfU413Nf]
module.common.module.customer.tfe_variable.customer_api_upstash_api_key: Refreshing state... [id=var-MzUHyoBcoBEPAsPX]
module.common.module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-tpb3p7Cgqgqw8nbC]
module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-FzMJRr3EsH3F5Xdx]
module.common.module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-beThZUmPmBTDt4BU]
module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-NYH82Zfthxa9VCug]
module.common.module.identity.tfe_variable.identity_api_upstash_api_key: Refreshing state... [id=var-LDi6uYZcDVLW155v]
module.common.module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-pXNYCh73JAkK4C4W]
module.common.module.shared.tfe_variable.shared_upstash_api_key: Refreshing state... [id=var-HMgJxKcdwXX3xR9n]
module.common.module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-D3tGhLCW11m7eiby]
module.common.module.customer.tfe_variable.customer_upstash_api_key: Refreshing state... [id=var-ZCamWHJ4niBZQMf8]
module.common.module.organization.tfe_workspace.organization: Refreshing state... [id=ws-zdxqmyp4WdPCXnMU]
module.common.module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-PWuv12iv7soy541V]
module.common.module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-nSbZJUvbmePXExxo]
module.common.module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-4tZ7Pu222pTXEyWc]
module.common.module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-TfF3xGSV5nyvMDty]
module.common_resources.data.tfe_organization.default: Refreshing...
module.common_resources.data.tfe_organization.default: Refresh complete after 1s [id=org-5y3MEgeuSg9nz1bX]
module.common_resources.data.tfe_workspace.default: Refreshing...
module.common_resources.data.tfe_workspace.default: Refresh complete after 0s [id=ws-wwXQa69M62VYdb4M]
module.common_resources.data.tfe_variables.default: Refreshing...
module.common_resources.data.tfe_variables.default: Refresh complete after 1s [id=variables/ws-wwXQa69M62VYdb4M]
module.common.module.customer.tfe_workspace.customer: Drift detected (update)
module.common.module.customer.tfe_workspace.customer_api: Drift detected (update)
module.common.module.identity.tfe_workspace.identity: Drift detected (update)
module.common.module.identity.tfe_workspace.identity_api: Drift detected (update)
module.common.module.organization.tfe_workspace.organization_api: Drift detected (update)
module.common.module.organization.tfe_workspace.organization: Drift detected (update)
module.common.module.shared.tfe_workspace.shared: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.common.tfe_project.default will be destroyed
  # (because tfe_project.default is not in configuration)
  - resource "tfe_project" "default" {
      - id           = "prj-5ptbkLDzF4VHVqKE" -> null
      - name         = "staging" -> null
      - organization = "connectilly" -> null
    }

  # module.common_resources.tfe_project.default will be created
  + resource "tfe_project" "default" {
      + id           = (known after apply)
      + name         = "staging"
      + organization = "connectilly"
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-4tZ7Pu222pTXEyWc" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-TfF3xGSV5nyvMDty" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-iDS7ceSq5YM9UUQ2" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-TfF3xGSV5nyvMDty" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-tpb3p7Cgqgqw8nbC" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-TfF3xGSV5nyvMDty" -> null
    }

  # module.common.module.customer.tfe_variable.customer_api_upstash_api_key will be destroyed
  # (because tfe_variable.customer_api_upstash_api_key is not in configuration)
  - resource "tfe_variable" "customer_api_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-MzUHyoBcoBEPAsPX" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-TfF3xGSV5nyvMDty" -> null
    }

  # module.common.module.customer.tfe_variable.customer_aws_access_key_id will be destroyed
  # (because tfe_variable.customer_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "customer_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-PWuv12iv7soy541V" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-CsUvPJtdKfkw6Tha" -> null
    }

  # module.common.module.customer.tfe_variable.customer_aws_secret_access_key will be destroyed
  # (because tfe_variable.customer_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "customer_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-TmYvRzLeD81uPDV9" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-CsUvPJtdKfkw6Tha" -> null
    }

  # module.common.module.customer.tfe_variable.customer_cockroach_api_key will be destroyed
  # (because tfe_variable.customer_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "customer_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-4CvzemYdaoQcYHWq" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-CsUvPJtdKfkw6Tha" -> null
    }

  # module.common.module.customer.tfe_variable.customer_upstash_api_key will be destroyed
  # (because tfe_variable.customer_upstash_api_key is not in configuration)
  - resource "tfe_variable" "customer_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-ZCamWHJ4niBZQMf8" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-CsUvPJtdKfkw6Tha" -> null
    }

  # module.common.module.customer.tfe_workspace.customer will be destroyed
  # (because tfe_workspace.customer is not in configuration)
  - resource "tfe_workspace" "customer" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-customer" -> null
      - id                            = "ws-CsUvPJtdKfkw6Tha" -> null
      - name                          = "staging-customer" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-5ptbkLDzF4VHVqKE" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 8 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "customer",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.customer.tfe_workspace.customer_api will be destroyed
  # (because tfe_workspace.customer_api is not in configuration)
  - resource "tfe_workspace" "customer_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-customer-api" -> null
      - id                            = "ws-TfF3xGSV5nyvMDty" -> null
      - name                          = "staging-customer-api" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-5ptbkLDzF4VHVqKE" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 19 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "customer",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-6jY14zttatVdUKAx" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-an6RcRzg5PUWp1EV" -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-FzMJRr3EsH3F5Xdx" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-an6RcRzg5PUWp1EV" -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-D3tGhLCW11m7eiby" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-an6RcRzg5PUWp1EV" -> null
    }

  # module.common.module.identity.tfe_variable.identity_api_upstash_api_key will be destroyed
  # (because tfe_variable.identity_api_upstash_api_key is not in configuration)
  - resource "tfe_variable" "identity_api_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-LDi6uYZcDVLW155v" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-an6RcRzg5PUWp1EV" -> null
    }

  # module.common.module.identity.tfe_variable.identity_aws_access_key_id will be destroyed
  # (because tfe_variable.identity_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "identity_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-djuphP2cNVB7ZjBB" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-jvmAACcB8pH3R5fM" -> null
    }

  # module.common.module.identity.tfe_variable.identity_aws_secret_access_key will be destroyed
  # (because tfe_variable.identity_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "identity_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-foBp9KWzdPo36bbk" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-jvmAACcB8pH3R5fM" -> null
    }

  # module.common.module.identity.tfe_variable.identity_cockroach_api_key will be destroyed
  # (because tfe_variable.identity_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "identity_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-nSbZJUvbmePXExxo" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-jvmAACcB8pH3R5fM" -> null
    }

  # module.common.module.identity.tfe_variable.identity_upstash_api_key will be destroyed
  # (because tfe_variable.identity_upstash_api_key is not in configuration)
  - resource "tfe_variable" "identity_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-5jsE9vWjpx2C5WQS" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-jvmAACcB8pH3R5fM" -> null
    }

  # module.common.module.identity.tfe_workspace.identity will be destroyed
  # (because tfe_workspace.identity is not in configuration)
  - resource "tfe_workspace" "identity" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-identity" -> null
      - id                            = "ws-jvmAACcB8pH3R5fM" -> null
      - name                          = "staging-identity" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-5ptbkLDzF4VHVqKE" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 8 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "identity",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.identity.tfe_workspace.identity_api will be destroyed
  # (because tfe_workspace.identity_api is not in configuration)
  - resource "tfe_workspace" "identity_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-identity-api" -> null
      - id                            = "ws-an6RcRzg5PUWp1EV" -> null
      - name                          = "staging-identity-api" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-5ptbkLDzF4VHVqKE" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 19 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "identity",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_api_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_api_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-beThZUmPmBTDt4BU" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-pXNYCh73JAkK4C4W" -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_api_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_api_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-NYH82Zfthxa9VCug" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-pXNYCh73JAkK4C4W" -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_api_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_api_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-viKCC52QLr1y5GBm" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-pXNYCh73JAkK4C4W" -> null
    }

  # module.common.module.organization.tfe_variable.organization_api_upstash_api_key will be destroyed
  # (because tfe_variable.organization_api_upstash_api_key is not in configuration)
  - resource "tfe_variable" "organization_api_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-ztvCC6442ZTsRg2d" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-pXNYCh73JAkK4C4W" -> null
    }

  # module.common.module.organization.tfe_variable.organization_aws_access_key_id will be destroyed
  # (because tfe_variable.organization_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "organization_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-9osT2C8rupAZuqaU" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-zdxqmyp4WdPCXnMU" -> null
    }

  # module.common.module.organization.tfe_variable.organization_aws_secret_access_key will be destroyed
  # (because tfe_variable.organization_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "organization_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-zu8QqzxM2YPdj21P" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-zdxqmyp4WdPCXnMU" -> null
    }

  # module.common.module.organization.tfe_variable.organization_cockroach_api_key will be destroyed
  # (because tfe_variable.organization_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "organization_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-CF14Qcd5FfU413Nf" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-zdxqmyp4WdPCXnMU" -> null
    }

  # module.common.module.organization.tfe_variable.organization_upstash_api_key will be destroyed
  # (because tfe_variable.organization_upstash_api_key is not in configuration)
  - resource "tfe_variable" "organization_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-9XugusGmh1ufCgKb" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-zdxqmyp4WdPCXnMU" -> null
    }

  # module.common.module.organization.tfe_workspace.organization will be destroyed
  # (because tfe_workspace.organization is not in configuration)
  - resource "tfe_workspace" "organization" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-organization" -> null
      - id                            = "ws-zdxqmyp4WdPCXnMU" -> null
      - name                          = "staging-organization" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-5ptbkLDzF4VHVqKE" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 8 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "organization",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.organization.tfe_workspace.organization_api will be destroyed
  # (because tfe_workspace.organization_api is not in configuration)
  - resource "tfe_workspace" "organization_api" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-organization-api" -> null
      - id                            = "ws-pXNYCh73JAkK4C4W" -> null
      - name                          = "staging-organization-api" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-5ptbkLDzF4VHVqKE" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 19 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "api",
          - "organization",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common.module.shared.tfe_variable.shared_aws_access_key_id will be destroyed
  # (because tfe_variable.shared_aws_access_key_id is not in configuration)
  - resource "tfe_variable" "shared_aws_access_key_id" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-uidVxrTST6gRrmGr" -> null
      - key          = "AWS_ACCESS_KEY_ID" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-qpd548bdizLT6Brv" -> null
    }

  # module.common.module.shared.tfe_variable.shared_aws_secret_access_key will be destroyed
  # (because tfe_variable.shared_aws_secret_access_key is not in configuration)
  - resource "tfe_variable" "shared_aws_secret_access_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-6w8raUq9aV6duruf" -> null
      - key          = "AWS_SECRET_ACCESS_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-qpd548bdizLT6Brv" -> null
    }

  # module.common.module.shared.tfe_variable.shared_cockroach_api_key will be destroyed
  # (because tfe_variable.shared_cockroach_api_key is not in configuration)
  - resource "tfe_variable" "shared_cockroach_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-xCXNYxxWHz4Z7y9j" -> null
      - key          = "COCKROACH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-qpd548bdizLT6Brv" -> null
    }

  # module.common.module.shared.tfe_variable.shared_upstash_api_key will be destroyed
  # (because tfe_variable.shared_upstash_api_key is not in configuration)
  - resource "tfe_variable" "shared_upstash_api_key" {
      - category     = "env" -> null
      - hcl          = false -> null
      - id           = "var-HMgJxKcdwXX3xR9n" -> null
      - key          = "TF_VAR_UPSTASH_API_KEY" -> null
      - sensitive    = true -> null
      - value        = (sensitive value) -> null
      - workspace_id = "ws-qpd548bdizLT6Brv" -> null
    }

  # module.common.module.shared.tfe_workspace.shared will be destroyed
  # (because tfe_workspace.shared is not in configuration)
  - resource "tfe_workspace" "shared" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "local" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = true -> null
      - global_remote_state           = false -> null
      - html_url                      = "https://app.terraform.io/app/connectilly/workspaces/staging-shared" -> null
      - id                            = "ws-qpd548bdizLT6Brv" -> null
      - name                          = "staging-shared" -> null
      - operations                    = false -> null
      - organization                  = "connectilly" -> null
      - project_id                    = "prj-5ptbkLDzF4VHVqKE" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - resource_count                = 4 -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "shared",
          - "staging",
        ] -> null
      - terraform_version             = "1.4.6" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_aws_access_key_id will be created
  + resource "tfe_variable" "customer_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_cockroach_api_key will be created
  + resource "tfe_variable" "customer_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_api_upstash_api_key will be created
  + resource "tfe_variable" "customer_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_aws_access_key_id will be created
  + resource "tfe_variable" "customer_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_aws_secret_access_key will be created
  + resource "tfe_variable" "customer_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_cockroach_api_key will be created
  + resource "tfe_variable" "customer_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_variable.customer_upstash_api_key will be created
  + resource "tfe_variable" "customer_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.customer.tfe_workspace.customer will be created
  + resource "tfe_workspace" "customer" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
    }

  # module.common_resources.module.customer.tfe_workspace.customer_api will be created
  + resource "tfe_workspace" "customer_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-customer-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "customer",
          + "staging",
        ]
      + terraform_version             = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_aws_access_key_id will be created
  + resource "tfe_variable" "identity_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_cockroach_api_key will be created
  + resource "tfe_variable" "identity_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_api_upstash_api_key will be created
  + resource "tfe_variable" "identity_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_aws_access_key_id will be created
  + resource "tfe_variable" "identity_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_aws_secret_access_key will be created
  + resource "tfe_variable" "identity_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_cockroach_api_key will be created
  + resource "tfe_variable" "identity_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_variable.identity_upstash_api_key will be created
  + resource "tfe_variable" "identity_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.identity.tfe_workspace.identity will be created
  + resource "tfe_workspace" "identity" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-identity"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "identity",
          + "staging",
        ]
      + terraform_version             = (known after apply)
    }

  # module.common_resources.module.identity.tfe_workspace.identity_api will be created
  + resource "tfe_workspace" "identity_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-identity-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "identity",
          + "staging",
        ]
      + terraform_version             = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_aws_access_key_id will be created
  + resource "tfe_variable" "organization_api_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_api_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_cockroach_api_key will be created
  + resource "tfe_variable" "organization_api_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_api_upstash_api_key will be created
  + resource "tfe_variable" "organization_api_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_aws_access_key_id will be created
  + resource "tfe_variable" "organization_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_aws_secret_access_key will be created
  + resource "tfe_variable" "organization_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_cockroach_api_key will be created
  + resource "tfe_variable" "organization_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_variable.organization_upstash_api_key will be created
  + resource "tfe_variable" "organization_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.organization.tfe_workspace.organization will be created
  + resource "tfe_workspace" "organization" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-organization"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "organization",
          + "staging",
        ]
      + terraform_version             = (known after apply)
    }

  # module.common_resources.module.organization.tfe_workspace.organization_api will be created
  + resource "tfe_workspace" "organization_api" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-organization-api"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "api",
          + "organization",
          + "staging",
        ]
      + terraform_version             = (known after apply)
    }

  # module.common_resources.module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_variable.shared_upstash_api_key will be created
  + resource "tfe_variable" "shared_upstash_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "TF_VAR_UPSTASH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.common_resources.module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "local"
      + file_triggers_enabled         = true
      + force_delete                  = true
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "staging-shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = (known after apply)
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "shared",
          + "staging",
        ]
      + terraform_version             = (known after apply)
    }

Plan: 36 to add, 0 to change, 36 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*